labplus-cn/mpython/port/boards/GENERIC/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "ESP32 module"
#define MICROPY_HW_MCU_NAME "ESP32"

#define 